## `terraform/main`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.aws_iam_policy_document.api_assume_policy: Reading...
module.ecr.aws_ecr_repository.repos: Refreshing state... [id=lambda-sample-ecr]
aws_apigatewayv2_api.api: Refreshing state... [id=dn35wi4wki]
aws_iam_role.lambda-sample-role: Refreshing state... [id=lambda-sample-role]
data.aws_iam_policy_document.api_assume_policy: Read complete after 0s [id=2690255455]
aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lambda-sample-role-20240916020901985000000001]
aws_apigatewayv2_stage.stage: Refreshing state... [id=$default]
aws_lambda_function.function: Refreshing state... [id=lambda-sample-function]
aws_lambda_function_url.function-url: Refreshing state... [id=lambda-sample-function]
aws_apigatewayv2_integration.integration: Refreshing state... [id=0lx65w5]
aws_apigatewayv2_route.route: Refreshing state... [id=rmblwwh]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.api will be created
  + resource "aws_iam_role" "api" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows api of lambda to call AWS services."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_minimum_serverless_api_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owner"     = "okmtdev"
          + "service"   = "lambda-sample"
          + "terraform" = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda-sample-role will be destroyed
  # (because aws_iam_role.lambda-sample-role is not in configuration)
  - resource "aws_iam_role" "lambda-sample-role" {
      - arn                   = "arn:aws:iam::761624429622:role/lambda-sample-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-09-16T02:09:01Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda-sample-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-sample-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "owner"     = "okmtdev"
          - "service"   = "lambda-sample"
          - "terraform" = "true"
        } -> null
      - unique_id             = "AROA3CVC2QQ3MONDLYQGW" -> null
    }

  # aws_iam_role_policy_attachment.lambda must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda" {
      ~ id         = "lambda-sample-role-20240916020901985000000001" -> (known after apply)
      ~ role       = "lambda-sample-role" -> "lambda_minimum_serverless_api_role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "lambda-sample-function"
      ~ memory_size                    = 128 -> 512
      ~ role                           = "arn:aws:iam::761624429622:role/lambda-sample-role" -> (known after apply)
        tags                           = {}
      ~ timeout                        = 3 -> 60
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function_url.function-url will be updated in-place
  ~ resource "aws_lambda_function_url" "function-url" {
        id                 = "lambda-sample-function"
        # (6 unchanged attributes hidden)

      + cors {
          + allow_credentials = false
          + allow_headers     = [
              + "*",
            ]
          + allow_methods     = [
              + "*",
            ]
          + allow_origins     = [
              + "*",
            ]
          + expose_headers    = [
              + "*",
            ]
          + max_age           = 0
        }
    }

  # aws_lambda_permission.api_url will be created
  + resource "aws_lambda_permission" "api_url" {
      + action                 = "lambda:InvokeFunctionUrl"
      + function_name          = "arn:aws:lambda:ap-northeast-1:761624429622:function:lambda-sample-function"
      + function_url_auth_type = "NONE"
      + id                     = (known after apply)
      + principal              = "*"
      + statement_id           = "FunctionURLAllowPublicAccess"
      + statement_id_prefix    = (known after apply)
    }

Plan: 3 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>